In [ ]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [ ]:
string_data

In [ ]:
string_data.notnull()

In [ ]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])

In [ ]:
data

In [ ]:
data.dropna(inplace = True)

In [ ]:
data

In [ ]:
data

In [ ]:
data

In [ ]:
data

In [ ]:
data.fillna(0)

In [ ]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

In [ ]:
data

In [ ]:
data.fillna({1:0, 2: 1, 0: 3})

In [ ]:
data.dropna()

In [ ]:
data.dropna(how = "all")

In [ ]:
data[4] = NA

In [ ]:
data.dropna(how = "all", axis = 1)

In [ ]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [ ]:
df

In [ ]:
df.dropna(thresh = 2)

In [ ]:
df.fillna(0)

In [ ]:
df.fillna({1 : 5,2 : 9, 0 : 3})

In [ ]:
df.fillna(method = "ffill")

In [ ]:
df.fillna(method = "bfill")

In [ ]:
df.fillna(method = "bfill", limit = 2, inplace = True)

In [ ]:
df

In [ ]:
df.fillna(df.mean())

In [ ]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [ ]:
data

In [ ]:
data[data.duplicated()]

In [ ]:
data.drop_duplicates()

In [ ]:
 data['v1'] = range(7)

In [ ]:
data

In [ ]:
data.drop_duplicates(['k1'])

In [ ]:
data.duplicated(['k1'])

In [ ]:
data.drop_duplicates(['k1','k2'], keep = 'last')

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [ ]:
data

In [ ]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [ ]:
meat_to_animal

In [ ]:
lowercased = data['food'].str.lower()

In [ ]:
data

In [ ]:
lowercased

In [ ]:
data['animal'] = lowercased.map(meat_to_animal)

In [ ]:
data

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [ ]:
data

In [ ]:
data.replace(-999,np.nan)

In [ ]:
data.replace([-999,-1000],np.nan)

In [ ]:
data.replace([-999,-1000],[4,5])

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data.rename(index= str.lower, columns = str.upper)

In [ ]:
data.rename(index = {'Ohio' : 'karachi'}, columns = {'three' : 'peshawar'})

In [ ]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32,18]

In [ ]:
bins = [18, 25, 35, 60, 100]
# cats = pd.cut(ages, bins)

In [ ]:
bins

In [ ]:
cats = pd.cut(ages, bins)

In [ ]:
cats

In [ ]:
cats.codes

In [ ]:
cats.categories

In [ ]:
cats.dtype

## Detecting and Filtering Outliers

In [ ]:
import numpy as np
import pandas as pd
data = pd.DataFrame(np.random.randn(1000, 4))
data

In [ ]:
data.describe() # define the staistics of the data

In [ ]:
# Suppose you wanted to find values in one of the columns exceeding 3 in absolute
# value:
col = data[2] 
col[np.abs(col) > 3] # only column 2

In [ ]:
data[(np.abs(data) > 3).any(1)] # all coulmns

In [ ]:
#Values can be set based on these criteria. Here is code to cap values outside the inter‐
# val –3 to 3:
data[np.abs(data) > 3] = np.sign(data) * 3
#np.sign(data) produces 1 and –1

In [ ]:
data.describe()

In [ ]:
np.sign(data).head()

## Permutation and Random Sampling

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

In [ ]:
sampler = np.random.permutation(5)
sampler #generate the array of integers in random sequence last number  not included

In [ ]:
# take function: take list of index and arrange data in the given manner
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

df.take(sampler)

In [ ]:
# sample method on Series and DataFrame:give random subset of data
df.sample(n=3)

## Computing Indicator/Dummy Variables

In [ ]:
# Another type of transformation for statistical modeling or machine learning applica‐
# tions is converting a categorical variable into a “dummy” or “indicator” matrix.

# Data‐Frame with k columns containing all 1s and 0s.


# pandas has a get_dummies function for doing this,

df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

df

In [ ]:
pd.get_dummies(df['key'])

In [ ]:
# In some cases, you may want to add a prefix to the columns in the indicator Data‐
# Frame, which can then be merged with the other data. get_dummies has a prefix argu‐
# ment for doing this:


dummies = pd.get_dummies(df['key'], prefix='key')
dummies

In [ ]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

## String Manipulation

In [ ]:
# word searching,replacing etc


val = 'a,b, guido'
val.split(',') # get separate character or word and return list

In [ ]:
# to remove withespace and line breaks we use split with strip

pieces = [x.strip() for x in val.split(',')]
pieces

In [ ]:
first, second, third = pieces
first + '::' + second + '::' + third

In [ ]:
'::'.join(pieces) #replace delimiter

### locating substrings.

In [ ]:
'guido' in val

In [ ]:
val = 'a,b, guido'
print(val)
val.index(',') #give the first index of subtring

In [ ]:
val.find(':')
# Note the difference between find and index is that index raises an exception if the
# string isn’t found

In [ ]:
# count returns the number of occurrences of a particular substring:
val.count(',')

In [ ]:
# replace will substitute occurrences of one pattern for another
val.replace(',', '::')

In [ ]:
val.replace(',', '')

## Regular Expressions

In [ ]:
# Regular expressions (regex) provide a flexible way to search or match  complex string patterns in text
# Note:
# The art of writing regular expressions could be a chapter of its own
# and thus is outside the book’s scope.



# The regex describing one or more whitespace characters (tabs, spaces, and newlines).
# is \s+:
import re
text = "foo bar\t baz \tqux"
re.split('\s+', text)

In [ ]:
text.split(' ')

In [ ]:
# When you call re.split('\s+', text), the regular expression is first compiled, and
# then its split method is called on the passed text

regex = re.compile('\s+')
regex.split(text)

In [ ]:
# to get a list of all patterns matching the regex, you can use the
# findall method:

regex.findall(text)

In [ ]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

In [ ]:

# findall returns all matches
# in a string, search returns only the first match. 

m = regex.search(text)
m

In [ ]:
text[m.start():m.end()]

In [ ]:
# sub will return a new string with occurrences of the pattern replaced by the
# a new string:

print(regex.sub('REDACTED', text))

In [ ]:
# Suppose you wanted to find email addresses and simultaneously segment each
# address into its three components: username, domain name, and domain suffix.

pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
# A match object produced by this modified regex returns a tuple of the pattern com‐
# ponents with its groups method:
m = regex.match('wesm@bright.net')
m

In [ ]:
m.groups()

In [ ]:
regex.findall(text)

In [ ]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

## Project

In [ ]:

#Project: code to extract phone numbers or e-mails from the given file and create two list (mail and phone number) 
# helping refrrence: Automate the Boring Stuff Using Python

In [1]:
#Replace Values
import pandas as pd
import numpy as np
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [5]:
import numpy as np 
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [6]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [7]:
data.replace([-999, -1000], [np.nan, 0]) #different replacement for each value

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [8]:
data.replace({-999: np.nan, -1000: 0})  #The argument passed can also be a dict:

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [10]:
 data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 index=['Ohio', 'Colorado', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [12]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [14]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [15]:
data.rename(index=str.title, columns=str.upper) #For temporary purpose

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [16]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [17]:
data=data.rename(index=str.title, columns=str.upper) #For permanent purpose assign it
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [22]:
data.rename(index={'Ohio': 'INDIANA'},
columns={'THREE': 'peekaboo'})

         ONE  TWO  peekaboo  FOUR
INDIANA    0    1         2     3
Colo       4    5         6     7
New        8    9        10    11

In [23]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

# Discretization and Binning

In [30]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [31]:
bins = [18, 25, 35, 60, 100] #(18,25)-->0,(25,35)-->1,(35,60)-->2,(60,100)-->3

In [32]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [33]:
#( not included [ Included

In [34]:
cats.codes #The interval made by pandas tell the index

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [35]:
cats.categories  #Tell the closed element the value include in an interval

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [36]:
 cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [37]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [38]:
 pd.cut(ages, [18, 26, 36, 61, 100], right=False)  #[bins we can define in this way] #by default right side True

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [40]:
 group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names) #The name should be in that order in which the Intervals are

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [42]:
 data = np.random.rand(20)
pd.cut(data, 4, precision=2) #precision--->how much value after decimal

[(0.26, 0.5], (0.018, 0.26], (0.018, 0.26], (0.26, 0.5], (0.75, 0.99], ..., (0.5, 0.75], (0.5, 0.75], (0.5, 0.75], (0.75, 0.99], (0.26, 0.5]]
Length: 20
Categories (4, interval[float64]): [(0.018, 0.26] < (0.26, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

# Detecting and Filtering Outliers

In [45]:
data = pd.DataFrame(np.random.randn(1000, 4))
col=data.head(10)
col

          0         1         2         3
0  1.845503 -0.018830 -0.455722  1.807503
1  0.519645  0.191492 -0.213334  0.279859
2 -1.852210  1.446609  1.725911 -1.288445
3  1.589242  0.525505  0.754881 -1.129782
4  0.172377 -0.434624 -0.758490  0.031480
5 -0.825371 -0.562153 -0.482587 -2.836138
6 -0.992570  0.042157  0.429410 -0.033367
7  1.418271  0.189177  0.400403  2.458850
8 -1.437963 -1.092743  1.762380 -0.231213
9 -0.042256  0.958259 -1.379043 -0.850272

In [46]:
col[np.abs(col) > 3]

    0   1   2   3
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
4 NaN NaN NaN NaN
5 NaN NaN NaN NaN
6 NaN NaN NaN NaN
7 NaN NaN NaN NaN
8 NaN NaN NaN NaN
9 NaN NaN NaN NaN

In [48]:
np.abs(col) #For positive Values

          0         1         2         3
0  1.845503  0.018830  0.455722  1.807503
1  0.519645  0.191492  0.213334  0.279859
2  1.852210  1.446609  1.725911  1.288445
3  1.589242  0.525505  0.754881  1.129782
4  0.172377  0.434624  0.758490  0.031480
5  0.825371  0.562153  0.482587  2.836138
6  0.992570  0.042157  0.429410  0.033367
7  1.418271  0.189177  0.400403  2.458850
8  1.437963  1.092743  1.762380  0.231213
9  0.042256  0.958259  1.379043  0.850272

In [49]:
np.abs(col) >= 1

       0      1      2      3
0   True  False  False   True
1  False  False  False  False
2   True   True   True   True
3   True  False  False   True
4  False  False  False  False
5  False  False  False   True
6  False  False  False  False
7   True  False  False   True
8   True   True   True  False
9  False  False   True  False

In [50]:
col[np.abs(col) >= 1]

          0         1         2         3
0  1.845503       NaN       NaN  1.807503
1       NaN       NaN       NaN       NaN
2 -1.852210  1.446609  1.725911 -1.288445
3  1.589242       NaN       NaN -1.129782
4       NaN       NaN       NaN       NaN
5       NaN       NaN       NaN -2.836138
6       NaN       NaN       NaN       NaN
7  1.418271       NaN       NaN  2.458850
8 -1.437963 -1.092743  1.762380       NaN
9       NaN       NaN -1.379043       NaN

In [52]:
np.abs(col[np.abs(col) >= 1])

          0         1         2         3
0  1.845503       NaN       NaN  1.807503
1       NaN       NaN       NaN       NaN
2  1.852210  1.446609  1.725911  1.288445
3  1.589242       NaN       NaN  1.129782
4       NaN       NaN       NaN       NaN
5       NaN       NaN       NaN  2.836138
6       NaN       NaN       NaN       NaN
7  1.418271       NaN       NaN  2.458850
8  1.437963  1.092743  1.762380       NaN
9       NaN       NaN  1.379043       NaN

In [53]:
 data[(np.abs(data) > 3).any(1)] # any(Here we have to pass value 1 or 0 b/c it is dataframe) return Full row exlude NaN rows

            0         1         2         3
141  1.225229 -3.208776  0.642128 -1.036886
203  3.014643 -0.511480  0.707652 -0.124139
556 -0.080614 -0.924601 -3.114946 -1.014504
588 -3.120847  1.209950  0.668397 -0.630684
690  0.126917 -3.037825  0.299017 -0.523401
796  0.604494  0.045984  0.917178 -3.934324
841 -1.438699 -1.261024 -3.225655 -1.952149
884  0.366438  1.703586  3.312154  0.704973
892  3.201676  0.608176  1.114057 -0.615237

In [54]:
np.sign(col) # jaha positive hai waha 1 and negative pr -1

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0  1.0 -1.0  1.0
2 -1.0  1.0  1.0 -1.0
3  1.0  1.0  1.0 -1.0
4  1.0 -1.0 -1.0  1.0
5 -1.0 -1.0 -1.0 -1.0
6 -1.0  1.0  1.0 -1.0
7  1.0  1.0  1.0  1.0
8 -1.0 -1.0  1.0 -1.0
9 -1.0  1.0 -1.0 -1.0

# Permutation and Random Sampling

In [55]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [59]:
sampler = np.random.permutation(5) # permutation return an array of the random index
sampler

array([1, 3, 4, 2, 0])

In [60]:
df.take(sampler)  # Complete Row will be Change

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [63]:
df.sample(n=3) #To select a random subset without replacement

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

# .head() starting 5 .tail() ending 5 iloc slicing

In [64]:
df.sample()

   0  1  2  3
1  4  5  6  7

In [65]:
#ASSIGNMENT HOW TO CREATE DOCSTRING


# Computing Indicator/Dummy Variables

In [71]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [72]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [73]:
a=[1,2,3,4]   #only single value added
a.append(5)
a

[1, 2, 3, 4, 5]

In [78]:
a.extend('6')  #iterate and then append
a

[1, 2, 3, 4, 5, '5', 6, 7, 8, '6', '6']

In [76]:
a.extend([6,7,8])
a

[1, 2, 3, 4, 5, '5', 6, 7, 8]

In [80]:
b=[2,7,8,9]
b.append([5,6])
b

[2, 7, 8, 9, [5, 6]]

In [81]:
b=[2,7,8,9]
b.extend([5,6])
b

[2, 7, 8, 9, 5, 6]

In [84]:
np.random.seed(12345)  #seed --> aik hi traha ki value fixed krde ge
values=np.random.rand(1)
values

array([0.92961609])

# String Object Methods

In [91]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [90]:
val[2] = val[2].strip()
val

TypeError: 'str' object does not support item assignment

In [108]:
val="pakistan Industrial Revolution"
val.split()

['pakistan', 'Industrial', 'Revolution']

In [97]:
"".join(val)

'pakistan Industrial Revoluution'

In [98]:
'pakistan' in val

True

In [101]:
val.index('p')

0

In [102]:
val.index('t')

5

In [103]:
val.index('d')

11

In [106]:
val.index('Revolution')

20

In [112]:
val[1].find('r') # if we use index then return error and if you use  find  thn no error and return -1

-1